app/controllers/posts_controller.rb

  def index
    @posts = Post.published.page(params[:page]).per(5).ordered
---
SELECT COUNT(*) FROM `posts` WHERE (published = 1)
SELECT `posts`.* FROM `posts` WHERE (published = 1) ORDER BY Created_at DESC LIMIT 5 OFFSET 0

  def create
    authorize! :create, @post
    @post = Post.new(params[:post])
    @post.user_id = current_user.id

    respond_to do |format|
      if @post.save
---
INSERT INTO `posts` (`body`, `created_at`, `published`, `title`, `updated_at`, `user_id`) VALUES ('Lorem ipsum dolor sit amet, consectetur adipiscing elit. Nunc volutpat elit non urna suscipit nec blandit urna gravida. Curabitur est neque, commodo eget scelerisque ac, malesuada vel libero. Donec eget metus luctus ante hendrerit iaculis. Sed scelerisque velit vitae mi interdum vel ornare mauris pulvinar. Nullam blandit orci quis leo vestibulum quis pretium elit interdum. Nam dapibus rhoncus dui, vitae faucibus ligula fermentum cursus. Morbi urna nunc, placerat ac faucibus venenatis, dignissim lacinia leo. Integer quis interdum lorem.', '2012-06-22 18:45:33', 1, 'Test Post 2', '2012-06-22 18:45:33', 1)

  def update
    @post = Post.find(params[:id])
  authorize! :update, @post
    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 3 LIMIT 1
UPDATE `posts` SET `published` = 0, `updated_at` = '2012-06-22 18:43:10' WHERE `posts`.`id` = 3

  def destroy
    @post = Post.find(params[:id])
    authorize! :destroy, @post
    @post.destroy
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
DELETE FROM `posts` WHERE `posts`.`id` = 1